RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_adc.c
/**
 **************************************************************************
 * File Name    : at32f4xx_adc.c
 * Description  : at32f4xx ADC source file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_adc.h"
#include "at32f4xx_rcc.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup ADC
  * @brief ADC driver modules
  * @{
  */

/** @defgroup ADC_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Defines
  * @{
  */

/* ADC DISCNUM mask */
#define CTRL1_DISCNUM_Reset         ((uint32_t)0xFFFF1FFF)

/* ADC DISCEN mask */
#define CTRL1_RDISCEN_Set           ((uint32_t)0x00000800)
#define CTRL1_RDISCEN_Rst           ((uint32_t)0xFFFFF7FF)

/* ADC JAUTO mask */
#define CTRL1_JAUT_Set              ((uint32_t)0x00000400)
#define CTRL1_JAUT_Rst              ((uint32_t)0xFFFFFBFF)

/* ADC JDISCEN mask */
#define CTRL1_JDISCEN_Set           ((uint32_t)0x00001000)
#define CTRL1_JDISCEN_Rst           ((uint32_t)0xFFFFEFFF)

/* ADC AWDCH mask */
#define CTRL1_AWDCH_Rst             ((uint32_t)0xFFFFFFE0)

/* ADC Analog watchdog enable mode mask */
#define CTRL1_AWDMode_Rst           ((uint32_t)0xFF3FFDFF)

/* CTRL1 register Mask */
#define CTRL1_CLEAR_MASK            ((uint32_t)0xFFF0FEFF)

/* ADC ADON mask */
#define CTRL2_ADON_Set              ((uint32_t)0x00000001)
#define CTRL2_ADON_Rst              ((uint32_t)0xFFFFFFFE)

/* ADC DMA mask */
#define CTRL2_DMA_Set               ((uint32_t)0x00000100)
#define CTRL2_DMA_Rst               ((uint32_t)0xFFFFFEFF)

/* ADC RSTCAL mask */
#define CTRL2_RSTCAL_Set            ((uint32_t)0x00000008)

/* ADC CAL mask */
#define CTRL2_CAL_Set               ((uint32_t)0x00000004)

/* ADC SWSTART mask */
#define CTRL2_SWSTR_Set             ((uint32_t)0x00400000)

/* ADC EXTTRIG mask */
#define CTRL2_EXTTRIG_Set           ((uint32_t)0x00100000)
#define CTRL2_EXTTRIG_Rst           ((uint32_t)0xFFEFFFFF)

/* ADC Software start mask */
#define CTRL2_EXTTRIG_SWSTR_Set     ((uint32_t)0x00500000)
#define CTRL2_EXTTRIG_SWSTR_Rst     ((uint32_t)0xFFAFFFFF)

/* ADC JEXTSEL mask */
#define CTRL2_JEXTSEL_Rst           ((uint32_t)0xFEFF8FFF)

/* ADC JEXTTRIG mask */
#define CTRL2_JEXTTRIG_Set          ((uint32_t)0x00008000)
#define CTRL2_JEXTTRIG_Rst          ((uint32_t)0xFFFF7FFF)

/* ADC JSWSTART mask */
#define CTRL2_JSWSTR_Set            ((uint32_t)0x00200000)

/* ADC injected software start mask */
#define CTRL2_JEXTTRIG_JSWSTR_Set   ((uint32_t)0x00208000)
#define CTRL2_JEXTTRIG_JSWSTR_Rst   ((uint32_t)0xFFDF7FFF)

/* ADC TSPD mask */
#define CTRL2_TSVREFE_Set           ((uint32_t)0x00800000)
#define CTRL2_TSVREFE_Rst           ((uint32_t)0xFF7FFFFF)

/* CTRL2 register Mask */
#define CTRL2_CLEAR_Msk             ((uint32_t)0xFDF1F7FD)

/* ADC SQx mask */
#define RSQ3_SQ_Set                 ((uint32_t)0x0000001F)
#define RSQ2_SQ_Set                 ((uint32_t)0x0000001F)
#define RSQ1_SQ_Set                 ((uint32_t)0x0000001F)

/* SQR1 register Mask */
#define RSQ1_CLEAR_Msk              ((uint32_t)0xFF0FFFFF)

/* ADC JSQx mask */
#define JSQR_JSQ_Set                ((uint32_t)0x0000001F)

/* ADC JL mask */
#define JSQR_JLEN_Set               ((uint32_t)0x00300000)
#define JSQR_JLEN_Rst               ((uint32_t)0xFFCFFFFF)

/* ADC SMPx mask */
#define SMPT1_SMP_Set               ((uint32_t)0x00000007)
#define SMPT2_SMP_Set               ((uint32_t)0x00000007)

/* ADC JDRx registers offset */
#define JDOR_Offset                 ((uint8_t)0x28)

/* ADC1 DR register base address */
#define DOR_ADDRESS                 ((uint32_t)0x4001244C)

/**
  * @}
  */

/** @defgroup ADC_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup ADC_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup ADC_Private_Functions
  * @{
  */

/**
  * @brief  Deinitializes the ADCx peripheral registers to their default reset values.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval None
  */
void ADC_Reset(ADC_Type* ADCx)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));

  if (ADCx == ADC1)
  {
    /* Enable ADC1 reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_ADC1, ENABLE);
    /* Release ADC1 from reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_ADC1, DISABLE);
  }
  else if (ADCx == ADC2)
  {
    /* Enable ADC2 reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_ADC2, ENABLE);
    /* Release ADC2 from reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_ADC2, DISABLE);
  }
#ifdef AT32F403xx
  else if (ADCx == ADC3)
  {
    /* Enable ADC3 reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_ADC3, ENABLE);
    /* Release ADC3 from reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_ADC3, DISABLE);
  }
#endif
}

/**
  * @brief  Initializes the ADCx peripheral according to the specified parameters
  *         in the ADC_InitStruct.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_InitStruct: pointer to an ADC_InitType structure that contains
  *         the configuration information for the specified ADC peripheral.
  * @retval None
  */
void ADC_Init(ADC_Type* ADCx, ADC_InitType* ADC_InitStruct)
{
  uint32_t tmpreg1 = 0;
  uint8_t tmpreg2 = 0;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_MODE(ADC_InitStruct->ADC_Mode));
  assert_param(IS_FUNCTIONAL_STATE(ADC_InitStruct->ADC_ScanMode));
  assert_param(IS_FUNCTIONAL_STATE(ADC_InitStruct->ADC_ContinuousMode));
  assert_param(IS_ADC_EXT_TRIG(ADC_InitStruct->ADC_ExternalTrig));
  assert_param(IS_ADC_DATA_ALIGN(ADC_InitStruct->ADC_DataAlign));
  assert_param(IS_ADC_REGULAR_LENGTH(ADC_InitStruct->ADC_NumOfChannel));

  /*---------------------------- ADCx CTRL1 Configuration -----------------*/
  /* Get the ADCx CTRL1 value */
  tmpreg1 = ADCx->CTRL1;
  /* Clear DUALMOD and SCAN bits */
  tmpreg1 &= CTRL1_CLEAR_MASK;
  /* Configure ADCx: Dual mode and scan conversion mode */
  /* Set DUALMOD bits according to ADC_Mode value */
  /* Set SCAN bit according to ADC_ScanConvMode value */
  tmpreg1 |= (uint32_t)(ADC_InitStruct->ADC_Mode | ((uint32_t)ADC_InitStruct->ADC_ScanMode << 8));
  /* Write to ADCx CTRL1 */
  ADCx->CTRL1 = tmpreg1;

  /*---------------------------- ADCx CTRL2 Configuration -----------------*/
  /* Get the ADCx CTRL2 value */
  tmpreg1 = ADCx->CTRL2;
  /* Clear CONT, ALIGN and EXTSEL bits */
  tmpreg1 &= CTRL2_CLEAR_Msk;
  /* Configure ADCx: external trigger event and continuous conversion mode */
  /* Set ALIGN bit according to ADC_DataAlign value */
  /* Set EXTSEL bits according to ADC_ExternalTrigConv value */
  /* Set CONT bit according to ADC_ContinuousConvMode value */
  tmpreg1 |= (uint32_t)(ADC_InitStruct->ADC_DataAlign | ADC_InitStruct->ADC_ExternalTrig |
                        ((uint32_t)ADC_InitStruct->ADC_ContinuousMode << 1));
  /* Write to ADCx CTRL2 */
  ADCx->CTRL2 = tmpreg1;

  /*---------------------------- ADCx SQR1 Configuration -----------------*/
  /* Get the ADCx SQR1 value */
  tmpreg1 = ADCx->RSQ1;
  /* Clear L bits */
  tmpreg1 &= RSQ1_CLEAR_Msk;
  /* Configure ADCx: regular channel sequence length */
  /* Set L bits according to ADC_NbrOfChannel value */
  tmpreg2 |= (uint8_t) (ADC_InitStruct->ADC_NumOfChannel - (uint8_t)1);
  tmpreg1 |= (uint32_t)tmpreg2 << 20;
  /* Write to ADCx SQR1 */
  ADCx->RSQ1 = tmpreg1;
}

/**
  * @brief  Fills each ADC_InitStruct member with its default value.
  * @param  ADC_InitStruct : pointer to an ADC_InitType structure which will be initialized.
  * @retval None
  */
void ADC_StructInit(ADC_InitType* ADC_InitStruct)
{
  /* Reset ADC init structure parameters values */
  /* Initialize the ADC_Mode member */
  ADC_InitStruct->ADC_Mode = ADC_Mode_Independent;
  /* initialize the ADC_ScanConvMode member */
  ADC_InitStruct->ADC_ScanMode = DISABLE;
  /* Initialize the ADC_ContinuousConvMode member */
  ADC_InitStruct->ADC_ContinuousMode = DISABLE;
  /* Initialize the ADC_ExternalTrigConv member */
  ADC_InitStruct->ADC_ExternalTrig = ADC_ExternalTrig_TMR1_CC1_ADC12;
  /* Initialize the ADC_DataAlign member */
  ADC_InitStruct->ADC_DataAlign = ADC_DataAlign_Right;
  /* Initialize the ADC_NbrOfChannel member */
  ADC_InitStruct->ADC_NumOfChannel = 1;
}

/**
  * @brief  Enables or disables the specified ADC peripheral.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  NewState: new state of the ADCx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_Ctrl(ADC_Type* ADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the ADON bit to wake up the ADC from power down mode */
    ADCx->CTRL2 |= CTRL2_ADON_Set;
  }
  else
  {
    /* Disable the selected ADC peripheral */
    ADCx->CTRL2 &= CTRL2_ADON_Rst;
  }
}

/**
  * @brief  Enables or disables the specified ADC DMA request.
  * @param  ADCx: where x can be 1 or 3 to select the ADC peripheral.
  *   Note: ADC2 hasn't a DMA capability.
  * @param  NewState: new state of the selected ADC DMA transfer.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_DMACtrl(ADC_Type* ADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_ADC_DMA_PERIPH(ADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected ADC DMA request */
    ADCx->CTRL2 |= CTRL2_DMA_Set;
  }
  else
  {
    /* Disable the selected ADC DMA request */
    ADCx->CTRL2 &= CTRL2_DMA_Rst;
  }
}

/**
  * @brief  Enables or disables the specified ADC interrupts.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_INT: specifies the ADC interrupt sources to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg ADC_INT_EC: End of conversion interrupt mask
  *     @arg ADC_INT_AWD: Analog watchdog interrupt mask
  *     @arg ADC_INT_JEC: End of injected conversion interrupt mask
  * @param  NewState: new state of the specified ADC interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_INTConfig(ADC_Type* ADCx, uint16_t ADC_INT, FunctionalState NewState)
{
  uint8_t itmask = 0;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_ADC_INT(ADC_INT));
  /* Get the ADC INT index */
  itmask = (uint8_t)ADC_INT;

  if (NewState != DISABLE)
  {
    /* Enable the selected ADC interrupts */
    ADCx->CTRL1 |= itmask;
  }
  else
  {
    /* Disable the selected ADC interrupts */
    ADCx->CTRL1 &= (~(uint32_t)itmask);
  }
}

/**
  * @brief  Resets the selected ADC calibration registers.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval None
  */
void ADC_RstCalibration(ADC_Type* ADCx)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  /* Resets the selected ADC calibration registers */
  ADCx->CTRL2 |= CTRL2_RSTCAL_Set;
}

/**
  * @brief  Gets the selected ADC reset calibration registers status.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @retval The new state of ADC reset calibration registers (SET or RESET).
  */
FlagStatus ADC_GetResetCalibrationStatus(ADC_Type* ADCx)
{
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));

