RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_adc.c
  /* Return the ADC_FLAG status */
  return  bitstatus;
}

/**
  * @brief  Clears the ADCx's pending flags.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_FLAG: specifies the flag to clear.
  *   This parameter can be any combination of the following values:
  *     @arg ADC_FLAG_AWD: Analog watchdog flag
  *     @arg ADC_FLAG_EC: End of conversion flag
  *     @arg ADC_FLAG_JEC: End of injected group conversion flag
  *     @arg ADC_FLAG_JSTR: Start of injected group conversion flag
  *     @arg ADC_FLAG_RSTR: Start of regular group conversion flag
  * @retval None
  */
void ADC_ClearFlag(ADC_Type* ADCx, uint8_t ADC_FLAG)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_CLEAR_FLAG(ADC_FLAG));
  /* Clear the selected ADC flags */
  ADCx->STS = ~(uint32_t)ADC_FLAG;
}

/**
  * @brief  Checks whether the specified ADC interrupt has occurred or not.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_INT: specifies the ADC interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg ADC_INT_EC: End of conversion interrupt mask
  *     @arg ADC_INT_AWD: Analog watchdog interrupt mask
  *     @arg ADC_INT_JEC: End of injected conversion interrupt mask
  * @retval The new state of ADC_INT (SET or RESET).
  */
ITStatus ADC_GetINTStatus(ADC_Type* ADCx, uint16_t ADC_INT)
{
  ITStatus bitstatus = RESET;
  uint32_t itmask = 0, enablestatus = 0;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_GET_INT(ADC_INT));
  /* Get the ADC INT index */
  itmask = ADC_INT >> 8;
  /* Get the ADC_INT enable bit status */
  enablestatus = (ADCx->CTRL1 & (uint8_t)ADC_INT) ;

  /* Check the status of the specified ADC interrupt */
  if (((ADCx->STS & itmask) != (uint32_t)RESET) && enablestatus)
  {
    /* ADC_INT is set */
    bitstatus = SET;
  }
  else
  {
    /* ADC_INT is reset */
    bitstatus = RESET;
  }

  /* Return the ADC_INT status */
  return  bitstatus;
}

/**
  * @brief  Clears the ADCx's interrupt pending bits.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_INT: specifies the ADC interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg ADC_INT_EC: End of conversion interrupt mask
  *     @arg ADC_INT_AWD: Analog watchdog interrupt mask
  *     @arg ADC_INT_JEC: End of injected conversion interrupt mask
  * @retval None
  */
void ADC_ClearINTPendingBit(ADC_Type* ADCx, uint16_t ADC_INT)
{
  uint8_t itmask = 0;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_INT(ADC_INT));
  /* Get the ADC INT index */
  itmask = (uint8_t)(ADC_INT >> 8);
  /* Clear the selected ADC interrupt pending bits */
  ADCx->STS = ~(uint32_t)itmask;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


